In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [9]:
os.chdir("F:\\DataScienceFull\\DataSet\\DataSets2\\")

In [11]:
dataset=pd.read_csv("titanic_train.csv")

In [12]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
dataset.shape

(891, 12)

In [15]:
dataset.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [71]:
df=dataset

In [101]:
X=df.drop(['PassengerId','Survived','Name','Ticket','Embarked'],axis=1)

In [102]:
X.shape

(891, 7)

In [103]:
Sex=pd.get_dummies(X['Sex'],drop_first=True)

In [104]:
Sex

     male
0       1
1       0
2       0
3       0
4       1
5       1
6       1
7       1
8       0
9       0
10      0
11      0
12      1
13      1
14      0
15      0
16      1
17      1
18      0
19      0
20      1
21      1
22      0
23      1
24      0
25      0
26      1
27      1
28      0
29      1
..    ...
861     1
862     0
863     0
864     1
865     0
866     0
867     1
868     1
869     1
870     1
871     0
872     1
873     1
874     0
875     0
876     1
877     1
878     1
879     0
880     0
881     1
882     0
883     1
884     1
885     0
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [105]:
X=X.drop(['Sex'],axis=1)

In [106]:
X=pd.concat([X,Sex],axis=1)

In [107]:
X.shape

(891, 7)

In [108]:
X.head()

   Pclass   Age  SibSp  Parch     Fare Cabin  male
0       3  22.0      1      0   7.2500   NaN     1
1       1  38.0      1      0  71.2833   C85     0
2       3  26.0      0      0   7.9250   NaN     0
3       1  35.0      1      0  53.1000  C123     0
4       3  35.0      0      0   8.0500   NaN     1

In [109]:
X.isnull().sum()

Pclass      0
Age       177
SibSp       0
Parch       0
Fare        0
Cabin     687
male        0
dtype: int64

In [110]:
X=X.drop(['Cabin'],axis=1)

In [111]:
X.shape

(891, 6)

In [112]:
X['Age']=X['Age'].fillna(X['Age'].mode()[0])

In [113]:
X.shape

(891, 6)

In [114]:
X.isnull().sum()

Pclass    0
Age       0
SibSp     0
Parch     0
Fare      0
male      0
dtype: int64

In [115]:
X.shape

(891, 6)

In [116]:
from sklearn.preprocessing import StandardScaler

In [117]:
sc=StandardScaler()

In [118]:
sc.fit(X)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [119]:
scale_feature=sc.transform(X)

In [120]:
X=scale_feature

In [121]:
X.shape

(891, 6)

In [122]:
y=dataset['Survived']

In [123]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [124]:
y=y.values

In [125]:
y.shape

(891,)

In [126]:
from sklearn.model_selection import train_test_split

In [127]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.33,random_state=10)

In [129]:
from sklearn.ensemble import RandomForestClassifier

In [134]:
model=RandomForestClassifier(n_estimators=100,max_depth=5,oob_score=True,n_jobs=-1)

In [135]:
model.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=5, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=-1, oob_score=True, random_state=None, verbose=0,
                       warm_start=False)

In [136]:
prediction=model.predict(X_test)

In [147]:
pd.DataFrame({'true_val':y_test,'pred_val':prediction}).head()

   true_val  pred_val
0         0         0
1         0         0
2         0         0
3         1         1
4         1         1

In [143]:
from sklearn.metrics import confusion_matrix,accuracy_score

In [141]:
cm=confusion_matrix(y_test,prediction)

In [142]:
cm

array([[169,  22],
       [ 26,  78]], dtype=int64)

In [144]:
score=accuracy_score(y_test,prediction)

In [145]:
score=np.round(score*100,2)

In [146]:
score

83.73